tutorials/combustion/fireFoam/les/smallPoolFire2D/constant/SpeciesTable
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      SpeciesTable;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fields
1
(

{
    name            ft;
    min             0;
    max             1;
    N               100;
}

)
;
output
5
(

{
    name            CH4;
}

{
    name            CO2;
}

{
    name            H2O;
}

{
    name            CO;
}

{
    name            soot;
}

)
;
values
6
(

101
(
0.001
0.011
0.021
0.031
0.041
0.051
0.061
0.071
0.081
0.091
0.101
0.111
0.121
0.131
0.141
0.151
0.161
0.171
0.181
0.191
0.201
0.211
0.221
0.231
0.241
0.251
0.261
0.271
0.281
0.291
0.301
0.311
0.321
0.331
0.341
0.351
0.361
0.371
0.381
0.391
0.401
0.411
0.421
0.431
0.441
0.451
0.461
0.471
0.481
0.491
0.501
0.511
0.521
0.531
0.541
0.551
0.561
0.571
0.581
0.591
0.601
0.611
0.621
0.631
0.641
0.651
0.661
0.671
0.681
0.691
0.701
0.711
0.721
0.731
0.741
0.751
0.761
0.771
0.781
0.791
0.801
0.811
0.821
0.831
0.841
0.851
0.861
0.871
0.881
0.891
0.901
0.911
0.921
0.931
0.941
0.951
0.961
0.971
0.981
0.991
0.999
)

101
(
0
0
0
0
0
0
0.0105883
0.0285208
0.0461843
0.0635849
0.0807284
0.0976204
0.114266
0.130672
0.146842
0.162782
0.178496
0.193989
0.209266
0.224332
0.23919
0.253845
0.268301
0.282563
0.296633
0.310517
0.324216
0.337736
0.35108
0.364251
0.377252
0.390087
0.402759
0.415271
0.427625
0.439826
0.451876
0.463777
0.475532
0.487144
0.498616
0.50995
0.521148
0.532214
0.543149
0.553955
0.564635
0.575191
0.585626
0.595941
0.606138
0.61622
0.626187
0.636044
0.64579
0.655428
0.66496
0.674387
0.683712
0.692935
0.702059
0.711085
0.720014
0.728849
0.73759
0.74624
0.754799
0.763269
0.771652
0.779948
0.788159
0.796287
0.804332
0.812297
0.820181
0.827987
0.835715
0.843367
0.850943
0.858445
0.865875
0.873232
0.880518
0.887735
0.894882
0.901961
0.908974
0.91592
0.922802
0.929619
0.936373
0.943064
0.949694
0.956263
0.962772
0.969222
0.975614
0.981948
0.988226
0.994448
0.999385
)

101
(
0.00200328
0.0213922
0.0396804
0.0569589
0.0733092
0.088804
0.0940165
0.0923125
0.0906341
0.0889806
0.0873516
0.0857465
0.0841647
0.0826058
0.0810693
0.0795547
0.0780615
0.0765893
0.0751376
0.073706
0.0722942
0.0709016
0.0695279
0.0681728
0.0668357
0.0655165
0.0642147
0.06293
0.0616621
0.0604105
0.0591751
0.0579555
0.0567514
0.0555625
0.0543885
0.0532292
0.0520842
0.0509534
0.0498363
0.0487329
0.0476428
0.0465658
0.0455017
0.0444503
0.0434112
0.0423844
0.0413695
0.0403664
0.0393749
0.0383948
0.0374258
0.0364678
0.0355206
0.0345841
0.033658
0.0327421
0.0318364
0.0309406
0.0300546
0.0291781
0.0283112
0.0274535
0.026605
0.0257655
0.0249349
0.024113
0.0232997
0.0224948
0.0216983
0.0209099
0.0201297
0.0193573
0.0185928
0.0178361
0.0170869
0.0163452
0.0156108
0.0148837
0.0141638
0.0134509
0.0127449
0.0120458
0.0113535
0.0106678
0.00998859
0.00931588
0.00864953
0.00798947
0.00733558
0.0066878
0.00604604
0.00541021
0.00478022
0.00415601
0.00353749
0.00292458
0.00231721
0.00171531
0.00111879
0.000527591
5.8413e-05
)

101
(
0.00400655
0.0427844
0.0793607
0.113918
0.146618
0.177608
0.188033
0.184625
0.181268
0.177961
0.174703
0.171493
0.168329
0.165212
0.162139
0.159109
0.156123
0.153179
0.150275
0.147412
0.144588
0.141803
0.139056
0.136346
0.133671
0.131033
0.128429
0.12586
0.123324
0.120821
0.11835
0.115911
0.113503
0.111125
0.108777
0.106458
0.104168
0.101907
0.0996727
0.0974658
0.0952856
0.0931317
0.0910035
0.0889006
0.0868225
0.0847688
0.082739
0.0807328
0.0787498
0.0767895
0.0748516
0.0729356
0.0710413
0.0691682
0.067316
0.0654843
0.0636728
0.0618812
0.0601091
0.0583563
0.0566223
0.054907
0.05321
0.051531
0.0498697
0.0482259
0.0465993
0.0449896
0.0433965
0.0418198
0.0402593
0.0387147
0.0371857
0.0356721
0.0341737
0.0326903
0.0312216
0.0297674
0.0283276
0.0269018
0.0254899
0.0240917
0.022707
0.0213355
0.0199772
0.0186318
0.0172991
0.0159789
0.0146712
0.0133756
0.0120921
0.0108204
0.00956045
0.00831202
0.00707498
0.00584917
0.00463443
0.00343062
0.00223758
0.00105518
0.000116826
)

101{0}
101{0}
)
;
